<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>PKG recipe for Egnyte Desktop Sync.</string>
    <key>Identifier</key>
    <string>com.github.aznh7-recipes.pkg.Egnyte Desktop Sync NoPrefs</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Egnyte Drive</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.1</string>
    <key>ParentRecipe</key>
    <string>com.github.aznh7-recipes.download.Egnyte Desktop Sync NoPrefs</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%pathname%</string>
                <key>target</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
