<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Docker and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.aznh7-recipes.pkg.Docker</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Docker</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.aznh7-recipes.download.Docker</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.aznh7-recipes.download.Docker</key>
			<dict>
				<key>git_hash</key>
				<string>0350fc695273568b8b8e3521a41c5cd18d730ee3</string>
				<key>path</key>
				<string>~/Sync/GitHub/aznh7-recipes/Docker/Docker.download.recipe</string>
				<key>sha256_hash</key>
				<string>1eb3f72408291d8738e2c754bec925ae294dda97106c5b3459ae015d245f025d</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<string>CodeSignatureVerifier</string>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
