<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of MacJREInstaller and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.aznh7.pkg.MacJREInstaller</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Java 8 Update 281</string>
		<key>NAME</key>
		<string>MacJREInstaller</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.aznh7.download.MacJREInstaller</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
