<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>com.github.aznh7.jss.MacJREInstaller</string>
	<key>Input</key>
	<dict>
		<key>APP_FILENAME</key>
		<string>Java 8 Update 281</string>
		<key>CATEGORY</key>
		<string>Productivity</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>MacJREInstaller</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string></string>
		<key>SELF_SERVICE_ICON</key>
		<string>%NAME%.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.aznh7.pkg.MacJREInstaller</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.aznh7.download.MacJREInstaller</key>
			<dict>
				<key>git_hash</key>
				<string>334764e77b60e689b3e5f8d1fee72ab32bc3daf5</string>
				<key>path</key>
				<string>~/Sync/GitHub/aznh7-recipes/JRE8-update-281/MacJREInstaller.download.recipe</string>
				<key>sha256_hash</key>
				<string>c5212aa45db91fadbafb918966f60add2ce120c6577a702131c51bb9fc001e9d</string>
			</dict>
			<key>com.github.aznh7.pkg.MacJREInstaller</key>
			<dict>
				<key>git_hash</key>
				<string>334764e77b60e689b3e5f8d1fee72ab32bc3daf5</string>
				<key>path</key>
				<string>~/Sync/GitHub/aznh7-recipes/JRE8-update-281/MacJREInstaller.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>bf12deb3860dd893a8cea99729e8f11e3f28ac1313e61a964524b59f11e23fc8</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>jss_inventory_name</key>
				<string>Java 8 Update 281</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
