<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Google Drive File Stream, repackages it, and then imports it into your JSS.</string>
	<key>Identifier</key>
	<string>com.github.aznh7-recipes.jss.googledrivefs</string>
	<key>Input</key>
	<dict>
		<key>GROUP_TEMPLATE</key>
		<string>GroupTemplate.xml</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>POLICY_CATEGORY</key>
		<string>%CATEGORY%</string>
		<key>package_notes</key>
		<string>Product of AutoPkg</string>

		<key>GROUP_NAME</key>
		<string>%NAME%-Testing</string>

		<key>NAME</key>
		<string>Google Drive</string>
		<key>CATEGORY</key>
		<string>Testing</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Access your Drive files directly from the cloud to your Mac or PC, freeing up disk space and network bandwidth.  Because Drive files are stored in the cloud, any changes you or your collaborators make are automatically updated everywhere, so you’ll always have the latest version.  You can also make Drive files available for offline access.  These cached files sync to the cloud and all your devices when you're back online.

With Drive, you can:
  * Quickly see all your Google Drive files in Finder (including Team Drives).
  * Browse and organize Google Drive files without downloading all of them to your computer.
  * Choose which files or folders you'd like to make available offline.
  * Open files in common apps like Microsoft Office and Adobe Photoshop.

Drive is only usable with G-Suite accounts.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>%RECIPE_DIR%/GoogleDrive.png</string>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.aznh7-recipes.pkg.googledrivefs</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>JSSImporter</string>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
