<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of AWS VPN Client</string>
	<key>Identifier</key>
	<string>com.github.aznh7-recipes.pkg.AWSVPNclient</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Docker</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.aznh7-recipes.download.AWSVPNclient</string>
    	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.aznh7-recipes.download.AWSVPNclient</key>
			<dict>
				<key>git_hash</key>
				<string>b8548942640a4dcea0b5889d787c4daa526a8ddf</string>
				<key>path</key>
				<string>~/Sync/GitHub/aznh7-recipes/AMZN/AWSVPNclient.download.recipe</string>
				<key>sha256_hash</key>
				<string>2180edaac7758a56b4ede3c08c442a89f07c8fef49155a854ded6e4ededcce77</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<string>CodeSignatureVerifier</string>
	<array>
		<dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>
