<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Figma and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.aznh7-recipes.pkg.SF Pro Fonts</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SF Pro Fonts</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.aznh7-recipes.download.SF Pro Fonts</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%RECIPE_CACHE_DIR%/Library/Fonts/SF-Pro-*.otf</string>
                <string>%RECIPE_CACHE_DIR%/Library/Fonts/SF-Pro.ttf</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>